Repository: Meirymm/handyvol
Catalog: Handyvol/Handyvol/*.lproj/Localizable.strings
Languages: kk

# app_title
source: Handyvol Platform
kk: Handyvol платформасы

source: Loading Profile...
kk: Профиль жүктелуде...

source: Profile
kk: Профиль

# login_button
source: Login
kk: Кіру

# register_title
source: Registration
kk: Тіркеу

# email_placeholder
source: Email
kk: Электрондық пошта

# password_placeholder
source: Password (min 8 symbols)
kk: Құпия сөз (мин 8 таңба)

# register_button
source: Register
kk: Тіркелу

# role_picker_title
source: Role:
kk: Рөлді таңдау:

# have_account_prompt
source: Already have an account? Login
kk: Аккаунт бар ма? Кіру

# no_account_prompt
source: No account? Register
kk: Аккаунт жоқ па? Тіркелу

# role_volunteer
source: Volunteer
kk: Ерікті

# role_organizer
source: Organizer
kk: Ұйымдастырушы

# password_safety_error
source: Password must be min 8 chars, contain letters, digits, and symbols.
kk: Құпия сөз талаптарға сай емес: мин 8 таңба, әріп, сан және символ.

source: Registration Failed
kk: Тіркеу қатесі

# login_failed
source: Login Failed: Invalid email or password.
kk: Кіру қатесі: Электрондық пошта немесе құпия сөз қате.

source: Logout Failed
kk: Шығу қатесі

# language_settings_title
source: Language Settings
kk: Тіл параметрлері

# restart_required_message
source: App restart required for full language change.
kk: Тілді толық өзгерту үшін қолданбаны қайта іске қосу қажет.

# volunteer_panel_title
source: Volunteer Panel
kk: Ерікті панелі

source: Search Events
kk: Іс-шараларды іздеу

source: My Applications
kk: Менің өтінімдерім

source: Loading events...
kk: Іс-шаралар жүктелуде...

source: No events found
kk: Іс-шаралар табылмады. Сүзгілерді өзгертіп көріңіз.

# filters_button
source: Filters
kk: Сүзгілер

# organizer_panel_title
source: Organizer Panel
kk: Ұйымдастырушы панелі

# organizer_events
source: My Events
kk: Менің іс-шараларым

source: Volunteer Applications
kk: Еріктілердің өтінімдері

# admin_panel_title
source: Admin Panel
kk: Әкімшілік панелі

# admin_dashboard
source: Dashboard
kk: Басқару тақтасы

source: User Moderation
kk: Қолданушы модерациясы

source: Event Moderation
kk: Іс-шара модерациясы

# logout_button
source: Logout
kk: Шығу

source: Account Settings
kk: Аккаунт параметрлері

source: App Settings
kk: Қолданба параметрлері

# notifications_settings
source: Notifications
kk: Хабарландырулар

# guest_user
source: Guest
kk: Қонақ

# event_date
source: Date:
kk: Күні:

# event_location
source: Location:
kk: Орналасқан жері:

source: Event Description
kk: Іс-шара сипаттамасы

# checking_status
source: Checking Application Status...
kk: Өтінім мәртебесін тексеру...

source: Application Pending
kk: Өтінім қаралуда

source: Application Approved
kk: Өтінім мақұлданды

# apply_button
source: Apply
kk: Өтінім жіберу

source: Application Error
kk: Өтінім қатесі

# event_closed
source: Event closed for applications
kk: Іс-шараға өтінімдер қабылдау тоқтатылды

# create_event_title
source: Create Event
kk: Іс-шара құру

source: Event Details
kk: Негізгі деректер

# event_title_placeholder
source: Event Title
kk: Іс-шара атауы

# event_location_placeholder
source: Location (City, Park)
kk: Орналасқан жері (Қала, Саябақ)

# event_description_placeholder
source: Description (min 50 chars)
kk: Сипаттама (мин 50 таңба)

# event_schedule_tags
source: Schedule & Tags
kk: Кесте және Тегтер

# event_date_label
source: Date
kk: Күні

# select_tags_label
source: Select Tags (min 1)
kk: Тегтерді таңдау (мин 1)

# create_event_button
source: Create Event
kk: Іс-шара құру

# saving_event
source: Saving...
kk: Сақтау...

# close_button
source: Close
kk: Жабу

# auth_required_error
source: Authorization required to perform this action.
kk: Бұл әрекетті орындау үшін авторизация қажет.

# data_integrity_error
source: Please fill in all mandatory fields.
kk: Барлық міндетті өрістерді толтырыңыз.

source: Event Creation Failed
kk: Іс-шараны құру қатесі

# search_placeholder
source: Search events...
kk: Атауы бойынша іздеу...

# search_button_text
source: Search
kk: Іздеу

# location_filter_title
source: Location
kk: Орналасқан жері

# location_filter_placeholder
source: Enter location
kk: Қала немесе аймақ

# tags_filter_title
source: Categories
kk: Тегтер

# filters_title
source: Filters
kk: Сүзгілер

# apply_filters_button
source: Apply Filters
kk: Сүзгілерді қолдану

# reset_filters_button
source: Reset
kk: Бастапқы күйге келтіру

# no_events_created
source: You haven't created any events yet.
kk: Сіз әлі ешқандай іс-шара құрған жоқсыз.

source: Status
kk: Мәртебе

source: Management
kk: Басқару

source: Manage Applications
kk: Өтінімдерді басқару

# close_event_button
source: Close Event
kk: Іс-шараны жабу

# no_applications_yet
source: No volunteer applications yet.
kk: Әзірге еріктілерден өтінім жоқ.

source: Applications for
kk: Өтінімдер

source: Applied on:
kk: Жіберілген:

# accept_button
source: Accept
kk: Қабылдау

# reject_button
source: Reject
kk: Бас тарту

source: Pending
kk: Қаралуда

source: Approved
kk: Мақұлданды

source: Rejected
kk: Бас тартылды

# volunteer_data_private
source: Volunteer
kk: Ерікті

source: No users found.
kk: Пайдаланушылар табылмады.

# role_admin
source: Admin
kk: Әкімші

source: User moderation title
kk: Пайдаланушы модерациясының атауы

# title_placeholder
source: Event Title
kk: Іс-шара атауы

# description_placeholder
source: Description, tasks, requirements
kk: Сипаттама, міндеттер, талаптар

# date_label
source: Date of Event
kk: Өткізу күні

# location_placeholder
source: Location
kk: Өткізу орны

source: Volunteer Requirements
kk: Еріктілерге қойылатын талаптар

source: Required Volunteers
kk: Қажетті еріктілер саны

# create_button
source: Create
kk: Құру

source: My Events
kk: Менің іс шараларым

# browse_events_tab
source: Search
kk: Іздеу

# notifications_tab
source: Notifications
kk: Хабарламалар

# profile_tab
source: Profile
kk: Менің парақшам

source: All users title
kk: Барлық қолданушылардың тізімі

# change_role_button
source: Change role
kk: Рольді өзгерту

source: Role cannot be changed
kk: Роль өзгертілмейді

source: Logged in as
kk: Ретінде кірді

# receive_notifications_toggle
source: Receive Notification
kk: Хабарламалар алу

source: System permission status
kk: Жүйелік рұқсаттар мәртебесі

# request_notifications_permission
source: Request notification permission
kk: Хабарламаға рұқсат сұрау

source: Send test notification
kk: Тестілеу туралы хабарлама жіберу

# language_select_label
source: Select language
kk: Тілді таңдаңыз

# volunteer_profile_title
source: Volunteer profile
kk: Еріктілер парақшасы

source: No notifications yet
kk: Әзірге хабарландырулар жоқ

source: Recent Notifications
kk: Соңғы хабарламалар

# organizer_profile_title
source: Organizer profile
kk: Организатор парақшасы

source: Manage users
kk: Пайдаланушыларды басқару

source: View statistics
kk: Статистиканы қарау

source: Statistics
kk: Статистика

source: User Statistics
kk: Пайдаланушы статистикасы

source: Event Statistics
kk: Іс шаралар статистикасы

source: Application Statistics
kk: Өтінімдер статистикасы

source: Total Users
kk: Барлық пайдаланушылар

source: Admins
kk: Администраторлар

source: Organizers
kk: Ұйымдастырушылар

source: Volunteers
kk: Еріктілер

source: Total Events
kk: Барлық оқиғалар

source: Total Applications
kk: Барлық өтінімдер

source: Pending Applications
kk: Күтудегі өтінімдер

source: Approved Applications
kk: Мақұлданған өтінімдер

source: NOTIFICATION SETTINGS
kk: ХАБАРЛАНДЫРУ ПАРАМЕТРЛЕРІ

source: Apply for event
kk: Іс-шараға өтініш беру

source: Create Event
kk: Жасау

# edit_event_title
source: Edit Event
kk: Іс-шараны өңдеу

# save_button
source: Save
kk: Сақтау

# delete_button
source: Delete
kk: Жою

# cancel_button
source: Cancel
kk: Болдырмау

# retry_button
source: Retry
kk: Қайталау

# edit_button
source: Edit
kk: Өзгерту

source: No events yet
kk: Әзірге іс-шаралар жоқ

# create_first_event
source: Create Your First Event
kk: Алғашқы іс-шараны жасаңыз

# event_updated_success
source: Event updated successfully
kk: Іс-шара сәтті жаңартылды

# delete_event_confirmation
source: Delete Event
kk: Іс-шараны жою

# delete_event_message
source: Are you sure you want to delete this event? This action cannot be undone.
kk: Сіз бұл іс-шараны жойғыңыз келетініне сенімдісіз бе? Бұл әрекетті болдырмау мүмкін емес.

source: Clear Filters
kk: Сүзгілерді тазалау

source: Clear All
kk: Барлығын тазалау

source: General
kk: Жалпы

source: Ecology
kk: Экология

source: Children
kk: Балалар

source: Sport
kk: Спорт

source: Education
kk: Білім

source: Health
kk: Денсаулық

source: Culture
kk: Мәдениет

source: User not authenticated
kk: Пайдаланушы авторизацияланбаған

# event_details_title
source: Event Details
kk: Оқиға туралы мәліметтер

# description_label
source: Description
kk: Сипаттама

# tags_label
source: Tags
kk: Тегтер

# apply_button_text
source: Apply to Event
kk: Оқиғаға өтініш беру

# applied_pending_text
source: Applied (Pending)
kk: Өтінім берілді (Күтуде)

source: Processing application...
kk: Өтінімді өңдеу...
